resources/use_cases/incompressible_icoFoam_cavity_cavityClipped/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1    # Run from this directory

# Source OpenFOAM run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

# Step 1: Prepare the time directories (copy 0 to 0.5)
echo "Copying 0 to 0.5 in $(pwd)"
cp -R 0 0.5

# Step 2: Map fields from the base cavity case
# Adjust the relative path if necessary.
echo "Mapping fields from ../incompressible_icoFoam_cavity_cavity to $(pwd)"
mapFields ../incompressible_icoFoam_cavity_cavity -case . -sourceTime latestTime > log.mapFields 2>&1

echo "Running blockMesh in $(pwd)"
runApplication blockMesh

echo "Running solver in $(pwd)"
runApplication $(getApplication)

echo "Converting to VTK"
runApplication foamToVTK

# Optionally, display the first 50 lines of log files:
echo "===== Displaying first 50 lines of logs ====="
find . -type f -name "log*" | while read -r log; do
    echo "---- $log ----"
    head -n 50 "$log"
    echo "--------------------------------------"
done
